<a href="https://colab.research.google.com/github/tinhb92/tay_quen/blob/master/sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
%%capture
!pip install -U pandasql
!pip install pydbgen

Initialize synthetic datasets

In [0]:
import pydbgen
from pydbgen import pydbgen
myDB=pydbgen.pydb()

In [9]:
df_name = myDB.gen_dataframe(20,['name','phone'], seed = 8)
df_name['company_id'] = range(20)
df_name.head()

             name  phone-number  company_id
0     Justin Holt  126-314-5269           0
1     Ryan Wilson  732-239-5883           1
2   Mitchell West  967-500-3934           2
3  Cynthia Martin  541-648-7294           3
4     Megan Rojas  381-227-9219           4

In [10]:
df_company = myDB.gen_dataframe(20,['company'])
df_company['company_id'] = range(20)
df_company['country_id'] = range(20)
df_company.head()

                       company  company_id  country_id
0  Saunders, Carter and Molina           0           0
1                  Morgan-Cook           1           1
2                Reid and Sons           2           2
3                   Hansen PLC           3           3
4                   Gibson Inc           4           4

In [11]:
df_country = myDB.gen_dataframe(20,['country','city'])
df_country['country_id'] = range(20)
df_country.head()

           country          city  country_id
0       Montenegro       McVeigh           0
1         Thailand       Paauilo           1
2         Tanzania     Lone Pine           2
3       Kazakhstan     Pine Lawn           3
4  Solomon Islands  Port Bolivar           4

In [0]:
from pandasql import sqldf#, load_meat, load_births
pysqldf = lambda q: sqldf(q, globals())

Qn 1. Join df_name with df_company and show the first 3 values

In [18]:
pysqldf("SELECT * FROM df_name INNER JOIN df_company ON df_name.company_id = df_company.company_id LIMIT 3")

            name  phone-number  ...  company_id country_id
0    Justin Holt  126-314-5269  ...           0          0
1    Ryan Wilson  732-239-5883  ...           1          1
2  Mitchell West  967-500-3934  ...           2          2

[3 rows x 6 columns]

Qn 2. Show people whose companies are in Thailand (or a certain country)

In [0]:
q = """
SELECT * 
FROM df_name
WHERE company_id IN

  (SELECT company_id 
  FROM df_company
  WHERE country_id = 

    (SELECT country_id 
    FROM df_country 
    WHERE country = 'Thailand')
  )
"""

In [24]:
pysqldf(q).head()

          name  phone-number  company_id
0  Ryan Wilson  732-239-5883           1

Qn 3. Show people whose company id > 3

In [0]:
q = """
SELECT * FROM df_name WHERE company_id > 3
"""

In [26]:
pysqldf(q).head()

            name  phone-number  company_id
0    Megan Rojas  381-227-9219           4
1  Edward Wagner  320-734-1920           5
2     Paige Snow  873-269-5975           6
3    Beth Jordan  449-694-4829           7
4   Joseph Smith  235-080-7901           8

In [0]:
pysqldf("SELECT SUM(CASE When beef>751 Then 1 Else 0 End ) as sum_beef FROM meat;").head()

   sum_beef
0       783

In [0]:
pysqldf("SELECT SUM(CASE When beef>751 Then beef Else 0 End ) as sum_beef FROM meat;").head()

    sum_beef
0  1361964.2

In [0]:
pysqldf("SELECT * FROM df_name LIMIT 1").head()

           name         city  phone-number  id
0  Caitlin Page  Clark Mills  245-346-1101   0

In [0]:
testdf=myDB.gen_dataframe(20,['name','city','phone','date'])

Multiple table; synthetic data for practice

In [0]:
q = """
SELECT * FROM df_name
INNER JOIN df_company
ON df_name.id = df_company.id
"""

Use the result as one table, nested

In [0]:
q = """
SELECT name FROM 
(SELECT * FROM df0 
INNER JOIN df1 
ON df0.id=df1.id) a
"""

In [0]:
q = """
SELECT a.name FROM 
(SELECT * FROM df0 
INNER JOIN df1 
ON df0.id=df1.id) a
"""

In [0]:
pysqldf(q).head()

           name         city  ...          city  id
0  Caitlin Page  Clark Mills  ...      Old Fort   0
1  Tyler Hudson    Pottsboro  ...    Warm Beach   1
2  Caitlin Mora  Carter Lake  ...      Hahntown   2
3  Tracey Davis  Mount Tabor  ...          Lulu   3
4   Howard Vang    Vanceburg  ...  Spragueville   4

[5 rows x 8 columns]

Inner join 2 nested

In [0]:
pysqldf("SELECT * FROM meat ORDER BY beef").head()

                         date   beef  veal  ...  broilers  other_chicken  turkey
0  1946-09-01 00:00:00.000000  366.0  98.0  ...       NaN            NaN     NaN
1  1946-06-01 00:00:00.000000  461.0  78.0  ...       NaN            NaN     NaN
2  1951-06-01 00:00:00.000000  591.0  78.0  ...       NaN            NaN     NaN
3  1946-05-01 00:00:00.000000  605.0  83.0  ...       NaN            NaN     NaN
4  1944-04-01 00:00:00.000000  650.0  89.0  ...       NaN            NaN     NaN

[5 rows x 8 columns]

In [0]:
q = """SELECT
        m.date, m.beef, b.births
     FROM
        meats m
     INNER JOIN
        births b
           ON m.date = b.date;"""

In [0]:
joined = pysqldf(q)

In [0]:
q = """select
           strftime('%Y', date) as year
           , SUM(beef) as beef_total
           FROM
              meat
           GROUP BY
              year;"""

In [0]:
pysqldf(q).head()

   year  beef_total
0  1944      8801.0
1  1945      9936.0
2  1946      9010.0
3  1947     10096.0
4  1948      8766.0